// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//     Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let x = 0;
// // let a = 0;
// // let a = 1;
// let a = -3;
// if (x === a) {
//     console.log("true");
// } else {
//     console.log("false")
// }


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код,
// який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
// let time = prompt("Число від 0 до 59");
// if ((time => 0) && (time <= 14)) {
//     console.log("Перша частина години");
// } else if ((time => 15) && (time <= 29)) {
//     console.log("Друга частина години");
// } else if ((time => 30) && (time <= 44)) {
//     console.log("Третя частина години");
// } else if ((time => 45) && (time <= 59)) {
//     console.log("Четверта частина години");
// }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця
// потрапляє це число (у першу, другу чи третю).
// let day = prompt("День місяцю");
// if ((day => 1) && (day <= 10)) {
//     console.log("Преша декада");
// } else if ((day => 11) && (day <= 20)) {
//     console.log("Друга декада");
// } else if ((day => 21) && (day <=31)) {
//     console.log("Третя декада");
// }

//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і
// на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

// let day = prompt("День тижня", "Понеділок").toLowerCase();
// switch (day) {
//     case "понеділок":
//         document.write('<p>"Понеділок"</p>');
//         break;
//     case "вівторок":
//         document.write('<p>"Вівторок"</p>');
//         break;
//     case "середа":
//         document.write('<p>"Середа"</p>');
//         break;
//     case "четвер":
//         document.write('<p>"Четвер"</p>');
//         break;
//     case "пятниця":
//         document.write('<p>"Пятниця"</p>');
//         break;
//     case "субота":
//         document.write('<p>"Субота"</p>');
//         break;
//     case "неділя":
//         document.write('<p>"Неділя"</p>');
//         break;
//     default:
//         alert("Вкажіть день тижня!!!")
//         break;
// }

//
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
// let a = prompt("Ведіть число");
// let b = prompt("Ведіть число");
// if (a>b) {
//     console.log(a);
// } else if (a<b) {
//     console.log(b);
// } else {
//     console.log("Числа рівні");
// }

//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х
//         являється falsy (хибноподыбне, тобто кастується до false)

// let x = 1;
// let x = 0;
// let x = "daasd";
// let x = {};
// let x = [];
// let x = undefined;
// let x = null;
// let x = true;
// let x = NaN;
//
//
// if ((!!x !== true) || (!!x === false)) {
//     x = "default";
//     console.log(x);
// }